tutorials/NACA0012/NACA0012_7k_M050_a2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass  AeroFoam;
 
startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           0.035;

deltaT            5e-06;

writeControl      runTime;

writeInterval     0.005;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  compressed;

timeFormat        general;

timePrecision     6;

graphFormat       raw;

runTimeModifiable yes;

adjustTimeStep    no;

maxCo             0.5;

maxDeltaT         1e-02;

functions       
(
);


// ************************************************************************* //
